import * as React from 'react';
import * as ReactDOM from 'react-dom'
import { Audio, SkipTimespan } from './components/audio-player/models';
// import {
//     MuiThemeProvider,
//     createMuiTheme,
// } from 'material-ui/styles';
import {
    AudioPlayer,
} from './components/audio-player/audio-player.component';
import { DeviceFamily } from './common/enums/device-family';

// const theme = createMuiTheme({
//     palette: {
//         primary: purple,
//         secondary: green,
//     },
// });

class App extends React.Component<{}, {}>{
    render() {
        return (
            <div>
                <AudioPlayer
                    PlayMode={AudioPlayer.PlayMode.SingleLoop}
                    IsCanRemoveItemFromPlaylist={true}
                    SkipNextButtonVisibility={false}
                    SkipPerviousButtonVisibility={true}
                    CoverImageVisibility={false}
                    Playlist={[
                        new Audio('每个爱情都危险', ['辛晓琪'], '[00:00.96]每个爱情都危险\n[00:03.29]演唱：辛晓琪、周华健\n[00:05.78]\n[00:19.23]爱不会永远新鲜 \n[00:21.20]爱人们啊 记住这点\n[00:25.06]守约真让人疲倦 \n[00:29.63]谁见过爱情不必诺言\n[00:33.24]如果你亲身体验 \n[00:37.40]爱情与幸福之间它并无关连\n[00:41.99]也许你会发现 \n[00:44.24]其实每个爱情都危险\n[00:50.10]每次开始都悱恻缠绵 \n[00:54.68]也能相安无事几个春天\n[00:58.22]而它只是一点点 oh 一点点 \n[01:02.71]它一天一点改变\n[01:06.55]再怎么深陷 再怎么痴恋\n[01:10.75]再怎么为爱奉献 \n[01:12.90]再怎么心甘情愿\n[01:14.94]爱虽是前世的缘 \n[01:17.69]更是今生的考验\n[01:21.08]\n[01:24.18]爱力量有限 爱人们啊 \n[01:28.17]别忘了这一点\n[01:32.69]永远不要那天 \n[01:34.53]流着眼泪 说着抱歉\n[01:39.63]若是曾亲身体验 \n[01:42.34]爱情与幸福之间它全无关连\n[01:47.33]终於你会发现 \n[01:49.38]其实每个爱情\n[01:53.23]每个爱情 每个爱情都危险\n[01:56.85]每次开始都悱恻缠绵 \n[01:59.62]也能相安无事几个春天\n[02:03.19]为何总是一点点 \n[02:05.65]oh 一点点 它一天一点改变\n[02:11.43]再怎么深陷 \n[02:14.37]再怎么痴恋\n[02:16.03]再怎么为爱奉献 \n[02:17.95]再怎么心甘情愿\n[02:20.04]爱虽是前世的缘 \n[02:22.68]更是今生的考验\n[02:27.09]\n[02:45.62]不必怀疑最初的坚决 \n[02:48.21]和那些真心付出的一切\n[02:52.13]有谁愿意失心到接近冷血 \n[02:56.40]也许他真的已再无感觉\n[03:00.57]\n[03:17.93]可惜不是每个人都了解\n[03:20.62]与其让它将心撕裂\n[03:23.72]不如接受它的幻灭\n[03:27.01]每次开始都悱恻缠绵 \n[03:29.40]也能相安无事几个春天\n[03:32.46]而它却一点点 \n[03:35.80]oh 一点点 它一天一点改变\n[03:41.46]再怎么深陷 再怎么痴恋\n[03:45.64]再怎么为爱奉献 \n[03:47.65]再怎么心甘情愿\n[03:49.75]爱虽是前世的缘 \n[03:52.55]更是今生的考验 考验\n[04:05.00]是考验\n[04:07.29]', 'http://audio.muzhifm.com/IarFile/Albums/2/ec8c1a18fc3b4cdfa13bf97f8eca5a26.jpg', 'http://audio.muzhifm.com/IarFile/Songs320/1593/15928984.mp3', 263.68, [{ EnteringTime: 30, EndingTime: 35 }, { EnteringTime: 55, EndingTime: 60 }]),
                        new Audio('牵牛花', ['阿牛', '阿马'], '[ti:牵牛花]\n[ar:阿牛]\n[al:浪花一朵朵]\n\n[00:00.00]牵牛花\n[00:10.00]阿牛\n[00:14.00]我爱的人爱别人 嫌我长相不够迷人\n[00:22.00]枉费我很勤奋向上和诚恳\n[00:25.00]怎么美丽人生只给美丽的人\n[00:30.00]我爱的人爱别人 嫌我赚钱太慢吞吞\n[00:37.00]这种惨案三不五时就发生\n[00:40.00]难免我的自尊 会有点裂痕\n[02:17.00][00:44.00]也许是爱情讨厌我们\n[02:20.00][00:48.00]也许我们没到缘份\n[02:23.00][00:51.00]但无论如何还是要坚忍\n[02:27.00][00:55.00]让孤单把我们锻炼成更好的人\n[02:31.00][00:59.00]也许是别人错过我们\n[02:35.00][01:03.00]也许他们没有福份\n[02:38.00][01:06.00]平凡如牵牛花的男人\n[02:40.00][01:08.00](牵牛花般的女人)\n[02:42.00][01:10.00]要很有品味才闻得到芳香灵魂\n[02:48.00][01:15.00]唉哟啦啦....\n[01:47.00]我爱的人爱别人 嫌我没有妩媚眼神\n[01:54.00]难道非要长得倾国和倾城\n[01:57.00]一个女生才能获得真心的吻\n[02:02.00]我爱的人爱别人 嫌我普通带不出门\n[02:09.00]看着窗外嘲笑我的霓虹灯\n[02:12.00]这花花世界 没有我的份\n[03:27.00]我爱的人爱别人\n', 'http://audio.muzhifm.com/IarFile/Albums/1/08f6967a-bd7f-42f4-adfe-4db2e568d5a8.jpg', 'http://audio.muzhifm.com/IarFile/Songs/1/89e4f842e42c4442b83af46597f6ffc1.mp3', 215.092),
                        new Audio('失恋阵线联盟', ['草蜢'], '\n[00:03.89]失恋阵线联盟\n[00:04.19]演唱：草蜢\n[00:06.4]\n[00:16.00]她总是只留下电话号码\n[00:19.91]从不肯让我送他回家\n[00:23.56]听说你也曾经爱上过她\n[00:27.21]曾经也同样无法自拔\n[00:30.93]你说你学不会假装潇洒\n[00:34.50]却教我别太早放弃她\n[00:38.22]把过去全说成一段神话\n[00:41.75]然后笑彼此一样地傻\n[00:45.38]我们这么在乎她\n[00:47.21]却被他全部抹煞\n[00:48.97]越疼她越伤心\n[00:50.76]永远得不到回答\n[00:52.69]到底她怎么想\n[00:54.44]应该继续猜测吗\n[00:56.54]还是说好全忘了吧\n[01:00.07]找一个承认失恋的方法\n[01:03.52]让心情好好地放个假\n[01:07.20]当你我不小心又想起她\n[01:10.84]就在记忆里划一个 X\n[01:14.24]\n[01:43.45]她总是只留下电话号码\n[01:47.06]从不肯让我送他回家\n[01:50.77]听说你也曾经爱上过她\n[01:54.39]曾经也同样无法自拔\n[01:58.00]你说你学不会假装潇洒\n[02:01.42]却教我别太早放弃她\n[02:05.29]把过去全说成一段神话\n[02:08.94]然后笑彼此一样地傻\n[02:12.20]我们这么在乎她\n[02:14.25]却被他全部抹煞\n[02:16.03]越疼她越伤心\n[02:17.93]永远得不到回答\n[02:19.76]到底她怎么想\n[02:21.54]应该继续猜测吗\n[02:23.70]还是说好全忘了吧\n[02:27.08]找一个承认失恋的方法\n[02:30.42]让心情好好地放个假\n[02:34.22]当你我不小心又想起她\n[02:37.98]就在记忆里划一个 x\n[02:41.54]就在记忆里划一个 x\n[02:45.22]就在记忆里划一个 x\n[02:48.68]\n', 'http://audio.muzhifm.com/IarFile/AlbumsNew/1/1462/196239.jpg', 'http://audio.muzhifm.com/IarFile/Songs/1/4791d65ea9274e059e0a1bcd97f43411.mp3', 173.4)
                    ]}
                />
                <div style={{
                    marginTop: 200
                }}>
                    <AudioPlayer
                        DeviceFamily={DeviceFamily.Phone}
                        SkipNextButtonVisibility={false}
                        Playlist={[
                            new Audio('每个爱情都危险', ['辛晓琪'], '[00:00.96]每个爱情都危险\n[00:03.29]演唱：辛晓琪、周华健\n[00:05.78]\n[00:19.23]爱不会永远新鲜 \n[00:21.20]爱人们啊 记住这点\n[00:25.06]守约真让人疲倦 \n[00:29.63]谁见过爱情不必诺言\n[00:33.24]如果你亲身体验 \n[00:37.40]爱情与幸福之间它并无关连\n[00:41.99]也许你会发现 \n[00:44.24]其实每个爱情都危险\n[00:50.10]每次开始都悱恻缠绵 \n[00:54.68]也能相安无事几个春天\n[00:58.22]而它只是一点点 oh 一点点 \n[01:02.71]它一天一点改变\n[01:06.55]再怎么深陷 再怎么痴恋\n[01:10.75]再怎么为爱奉献 \n[01:12.90]再怎么心甘情愿\n[01:14.94]爱虽是前世的缘 \n[01:17.69]更是今生的考验\n[01:21.08]\n[01:24.18]爱力量有限 爱人们啊 \n[01:28.17]别忘了这一点\n[01:32.69]永远不要那天 \n[01:34.53]流着眼泪 说着抱歉\n[01:39.63]若是曾亲身体验 \n[01:42.34]爱情与幸福之间它全无关连\n[01:47.33]终於你会发现 \n[01:49.38]其实每个爱情\n[01:53.23]每个爱情 每个爱情都危险\n[01:56.85]每次开始都悱恻缠绵 \n[01:59.62]也能相安无事几个春天\n[02:03.19]为何总是一点点 \n[02:05.65]oh 一点点 它一天一点改变\n[02:11.43]再怎么深陷 \n[02:14.37]再怎么痴恋\n[02:16.03]再怎么为爱奉献 \n[02:17.95]再怎么心甘情愿\n[02:20.04]爱虽是前世的缘 \n[02:22.68]更是今生的考验\n[02:27.09]\n[02:45.62]不必怀疑最初的坚决 \n[02:48.21]和那些真心付出的一切\n[02:52.13]有谁愿意失心到接近冷血 \n[02:56.40]也许他真的已再无感觉\n[03:00.57]\n[03:17.93]可惜不是每个人都了解\n[03:20.62]与其让它将心撕裂\n[03:23.72]不如接受它的幻灭\n[03:27.01]每次开始都悱恻缠绵 \n[03:29.40]也能相安无事几个春天\n[03:32.46]而它却一点点 \n[03:35.80]oh 一点点 它一天一点改变\n[03:41.46]再怎么深陷 再怎么痴恋\n[03:45.64]再怎么为爱奉献 \n[03:47.65]再怎么心甘情愿\n[03:49.75]爱虽是前世的缘 \n[03:52.55]更是今生的考验 考验\n[04:05.00]是考验\n[04:07.29]', 'http://audio.muzhifm.com/IarFile/Albums/2/ec8c1a18fc3b4cdfa13bf97f8eca5a26.jpg', 'http://audio.muzhifm.com/IarFile/Songs320/1593/15928984.mp3', 263.68, [{ EnteringTime: 30, EndingTime: 35 }, { EnteringTime: 55, EndingTime: 60 }]),
                            new Audio('牵牛花', ['阿牛', '阿马'], '[ti:牵牛花]\n[ar:阿牛]\n[al:浪花一朵朵]\n\n[00:00.00]牵牛花\n[00:10.00]阿牛\n[00:14.00]我爱的人爱别人 嫌我长相不够迷人\n[00:22.00]枉费我很勤奋向上和诚恳\n[00:25.00]怎么美丽人生只给美丽的人\n[00:30.00]我爱的人爱别人 嫌我赚钱太慢吞吞\n[00:37.00]这种惨案三不五时就发生\n[00:40.00]难免我的自尊 会有点裂痕\n[02:17.00][00:44.00]也许是爱情讨厌我们\n[02:20.00][00:48.00]也许我们没到缘份\n[02:23.00][00:51.00]但无论如何还是要坚忍\n[02:27.00][00:55.00]让孤单把我们锻炼成更好的人\n[02:31.00][00:59.00]也许是别人错过我们\n[02:35.00][01:03.00]也许他们没有福份\n[02:38.00][01:06.00]平凡如牵牛花的男人\n[02:40.00][01:08.00](牵牛花般的女人)\n[02:42.00][01:10.00]要很有品味才闻得到芳香灵魂\n[02:48.00][01:15.00]唉哟啦啦....\n[01:47.00]我爱的人爱别人 嫌我没有妩媚眼神\n[01:54.00]难道非要长得倾国和倾城\n[01:57.00]一个女生才能获得真心的吻\n[02:02.00]我爱的人爱别人 嫌我普通带不出门\n[02:09.00]看着窗外嘲笑我的霓虹灯\n[02:12.00]这花花世界 没有我的份\n[03:27.00]我爱的人爱别人\n', 'http://audio.muzhifm.com/IarFile/Albums/1/08f6967a-bd7f-42f4-adfe-4db2e568d5a8.jpg', 'http://audio.muzhifm.com/IarFile/Songs/1/89e4f842e42c4442b83af46597f6ffc1.mp3', 215.092),
                            new Audio('失恋阵线联盟', ['草蜢'], '\n[00:03.89]失恋阵线联盟\n[00:04.19]演唱：草蜢\n[00:06.4]\n[00:16.00]她总是只留下电话号码\n[00:19.91]从不肯让我送他回家\n[00:23.56]听说你也曾经爱上过她\n[00:27.21]曾经也同样无法自拔\n[00:30.93]你说你学不会假装潇洒\n[00:34.50]却教我别太早放弃她\n[00:38.22]把过去全说成一段神话\n[00:41.75]然后笑彼此一样地傻\n[00:45.38]我们这么在乎她\n[00:47.21]却被他全部抹煞\n[00:48.97]越疼她越伤心\n[00:50.76]永远得不到回答\n[00:52.69]到底她怎么想\n[00:54.44]应该继续猜测吗\n[00:56.54]还是说好全忘了吧\n[01:00.07]找一个承认失恋的方法\n[01:03.52]让心情好好地放个假\n[01:07.20]当你我不小心又想起她\n[01:10.84]就在记忆里划一个 X\n[01:14.24]\n[01:43.45]她总是只留下电话号码\n[01:47.06]从不肯让我送他回家\n[01:50.77]听说你也曾经爱上过她\n[01:54.39]曾经也同样无法自拔\n[01:58.00]你说你学不会假装潇洒\n[02:01.42]却教我别太早放弃她\n[02:05.29]把过去全说成一段神话\n[02:08.94]然后笑彼此一样地傻\n[02:12.20]我们这么在乎她\n[02:14.25]却被他全部抹煞\n[02:16.03]越疼她越伤心\n[02:17.93]永远得不到回答\n[02:19.76]到底她怎么想\n[02:21.54]应该继续猜测吗\n[02:23.70]还是说好全忘了吧\n[02:27.08]找一个承认失恋的方法\n[02:30.42]让心情好好地放个假\n[02:34.22]当你我不小心又想起她\n[02:37.98]就在记忆里划一个 x\n[02:41.54]就在记忆里划一个 x\n[02:45.22]就在记忆里划一个 x\n[02:48.68]\n', 'http://audio.muzhifm.com/IarFile/AlbumsNew/1/1462/196239.jpg', 'http://audio.muzhifm.com/IarFile/Songs/1/4791d65ea9274e059e0a1bcd97f43411.mp3', 173.4)
                        ]}
                    />
                    <AudioPlayer
                    />
                </div>
            </div>
        );
    }
}

ReactDOM.render(
    <App />,
    document.getElementById('root')
);